programming/ex1/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1400;
        startFace       205350;
    }
    outlet
    {
        type            patch;
        nFaces          1400;
        startFace       206750;
    }
    pipe
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       208150;
    }
    symmetryVer
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2250;
        startFace       210150;
    }
    symmetryHor
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2250;
        startFace       212400;
    }
)

// ************************************************************************* //
